app/views/gardens/show.html.erb

  <div class="cards my-5">
    <% @garden.plants.each do |plant| %>
---
SELECT "plants".* FROM "plants" WHERE "plants"."garden_id" = ?  [["garden_id", 1]]

        <%= plant.name %>
        <% plant.completions.each do |completion| %>
---
SELECT "completions".* FROM "completions" WHERE "completions"."plant_id" = ?  [["plant_id", 1]]