app/controllers/completions_controller.rb

  def new
    @plant = Plant.find(params[:plant_id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @plant = Plant.find(params[:plant_id])
    @completion = Completion.new(completion_params)
    @completion.plant = @plant
    @completion.save
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "completions" ("plant_id", "chore_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["plant_id", 1], ["chore_id", 2], ["created_at", "2024-08-22 21:06:45.124181"], ["updated_at", "2024-08-22 21:06:45.124181"]]